In [15]:
# Create two dataframes that have commmon columns say X1
import pandas as pd
import numpy as np

adf = pd.DataFrame(data={'x1': ['A', 'B', 'C'], 'x2' : [1, 2, 3]})

In [16]:
adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [17]:
bdf = pd.DataFrame(data={'x1': ['A', 'B', 'D'], 'x3' : ['T', 'F', 'T']})
bdf

  x1 x3
0  A  T
1  B  F
2  D  T

In [18]:
# Merge adf and bdf based on adf
pd.merge(adf, bdf, how='left')

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

In [19]:
# Merge bdf on adf

In [20]:
pd.merge(adf, bdf, how="right")

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

In [21]:
pd.merge(adf, bdf, how="inner")

  x1  x2 x3
0  A   1  T
1  B   2  F

In [22]:
# unon of merge for adf and bdf
pd.merge(adf, bdf, how='outer')

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

In [23]:
# append bdf andter bdf
pd.concat([adf, bdf], sort=True)

  x1   x2   x3
0  A  1.0  NaN
1  B  2.0  NaN
2  C  3.0  NaN
0  A  NaN    T
1  B  NaN    F
2  D  NaN    T

In [24]:
# Column wise concatination
pd.concat([adf,bdf], axis=1)

  x1  x2 x1 x3
0  A   1  A  T
1  B   2  B  F
2  C   3  D  T

In [25]:
# Sliceing dataframe based on largest value of a specific coulumns
# no.nan is null but can be interpreted a s anumber

In [26]:
df = pd.DataFrame({'a': [1, 10, 8, 11, -1],'b': list('abdce'), 'c': [1.0, 2.0, np.nan, 3.0, 4.0]})

In [27]:
df

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  d  NaN
3  11  c  3.0
4  -1  e  4.0

In [29]:
# count null in C
df['c'].isnull().sum()

1

In [30]:
data = {'weekday': ["Monday", "Tuesday", "Wednesday", 
         "Thursday", "Friday", "Saturday", "Sunday"],
        'Person 1': [12, 6, 5, 8, 11, 6, 4],
        'Person 2': [10, 6, 11, 5, 8, 9, 12],
        'Person 3': [8, 5, 7, 3, 7, 11, 15]}
df = pd.DataFrame(data, columns=['weekday',
        'Person 1', 'Person 2', 'Person 3'])

In [32]:
# reshape pandas with melt
df

     weekday  Person 1  Person 2  Person 3
0     Monday        12        10         8
1    Tuesday         6         6         5
2  Wednesday         5        11         7
3   Thursday         8         5         3
4     Friday        11         8         7
5   Saturday         6         9        11
6     Sunday         4        12        15

In [33]:
melted =df.melt(df, id_vars=["weekday"], var_name= "Persion", calue_name="score")

TypeError: melt() got multiple values for argument 'id_vars'